app/Controllers/Cart.php

SELECT `a`.*, `b`.`CategoryName`
FROM `tblproduct` `a`
LEFT JOIN `tblcategory` `b` ON `b`.`categoryID`=`a`.`categoryID`
WHERE `a`.`productID` = 'assets'
---
    public function productDetails($id)
    {
        $builder = $this->db->table('tblproduct a');
        $builder->select('a.*,b.CategoryName');
        $builder->join('tblcategory b','b.categoryID=a.categoryID','LEFT');
        $builder->WHERE('a.productID',$id);
        $products = $builder->get()->getResult();

SELECT *
FROM `tblpayment`
WHERE `TransactionNo` LIKE '%%%%' ESCAPE '!'
AND `Status` <> 0
---
    public function searchOrders()
    {
        $text = "%".$this->request->getGet('keyword')."%";
        $builder = $this->db->table('tblpayment');
        $builder->select('*');
        $builder->LIKE('TransactionNo',$text)->WHERE('Status<>',0);
        $data = $builder->get();