app/Controllers/Home.php

SELECT *
FROM `tblaccount`
WHERE `Email` = 'admin@gmail.com'
AND `Status` = 1
---
    public function validateUser()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $validation = $this->validate([
            'email'=>'required|valid_email',
            'password'=>'required'
        ]);

        if(!$validation)
        {
            session()->setFlashdata('fail','Invalid email or password');
            return redirect()->to('/login')->withInput();
        }
        else
        {
            $builder = $this->db->table('tblaccount');
            $builder->select('*');
            $builder->WHERE('Email',$email)->WHERE('Status',1);
            $data = $builder->get();

SELECT `a`.*, `b`.`CategoryName`
FROM `tblproduct` `a`
LEFT JOIN `tblcategory` `b` ON `b`.`categoryID`=`a`.`categoryID`
GROUP BY `a`.`productID`
ORDER BY `a`.`productID` DESC
 LIMIT 5
---
    public function index()
    {
        $builder = $this->db->table('tblproduct a');
        $builder->select('a.*,b.CategoryName');
        $builder->join('tblcategory b','b.categoryID=a.categoryID','LEFT');
        $builder->groupBy('a.productID')->orderBy('a.productID','DESC')->limit(4);
        $products = $builder->get()->getResult();
        //new products
        $builder = $this->db->table('tblproduct a');
        $builder->select('a.*,b.CategoryName');
        $builder->join('tblcategory b','b.categoryID=a.categoryID','LEFT');
        $builder->WHERE('DATE_FORMAT(DateCreated,"%m")',date('m'));
        $builder->WHERE('DATE_FORMAT(DateCreated,"%Y")',date('Y'));
        $builder->groupBy('a.productID')->orderBy('a.productID','DESC')->limit(4);
        $newProduct = $builder->get()->getResult();
        //featured
        $builder = $this->db->table('tblproduct a');
        $builder->select('a.*,b.CategoryName');
        $builder->join('tblcategory b','b.categoryID=a.categoryID','LEFT');
        $builder->WHERE('a.feature','Yes');
        $builder->groupBy('a.productID')->orderBy('a.productID','DESC')->limit(4);
        $feature = $builder->get()->getResult();
        //on sales
        $builder = $this->db->table('tblproduct a');
        $builder->select('a.*,b.CategoryName');
        $builder->join('tblcategory b','b.categoryID=a.categoryID','LEFT');
        $builder->WHERE('a.onSales','Yes');
        $builder->groupBy('a.productID')->orderBy('a.productID','DESC')->limit(4);
        $discounted = $builder->get()->getResult();

SELECT `a`.*, `b`.`CategoryName`
FROM `tblproduct` `a`
LEFT JOIN `tblcategory` `b` ON `b`.`categoryID`=`a`.`categoryID`
GROUP BY `a`.`productID`
ORDER BY `a`.`productID` DESC
---
    public function store()
    {
        $builder = $this->db->table('tblproduct a');
        $builder->select('a.*,b.CategoryName');
        $builder->join('tblcategory b','b.categoryID=a.categoryID','LEFT');
        $builder->groupBy('a.productID')->orderBy('a.productID','DESC');
        $products = $builder->get()->getResult();

SELECT `a`.*, `b`.`CategoryName`
FROM `tblproduct` `a`
LEFT JOIN `tblcategory` `b` ON `b`.`categoryID`=`a`.`categoryID`
WHERE `a`.`categoryID` = '1'
GROUP BY `a`.`productID`
ORDER BY `a`.`productID` DESC
SELECT *
FROM `tblcategory`
---
    public function searchProducts()
    {
        $text = "%".$this->request->getGet('keyword')."%";
        $builder = $this->db->table('tblproduct a');
        $builder->select('a.*,b.CategoryName');
        $builder->join('tblcategory b','b.categoryID=a.categoryID','LEFT');
        $builder->LIKE('a.productName',$text);
        $builder->groupBy('a.productID')->orderBy('a.productID','DESC');
        $data = $builder->get();