app/Controllers/Home.php

SELECT IFNULL(SUM(Total), 0)total
FROM `tblpayment`
WHERE `Status` <> 0
AND DATE_FORMAT(DateCreated,"%m") = '05'
AND DATE_FORMAT(DateCreated,"%Y") = '2024'
---
    public function dashboard()
    {
        //orders
        $customer = 0;
        $builder = $this->db->table('tblcustomer');
        $builder->select('COUNT(customerID)total');
        $builder->WHERE('Status',1);
        $orderList = $builder->get();
        if($row = $orderList->getRow())
        {
            $customer = $row->total;
        }
        //orders
        $order = 0;
        $builder = $this->db->table('tblpayment');
        $builder->select('COUNT(paymentID)total');
        $builder->WHERE('Status',0);
        $orderList = $builder->get();
        if($row = $orderList->getRow())
        {
            $order = $row->total;
        }
        //revenue for the month
        $income = 0;$month = date('m');$year = date('Y');
        $builder = $this->db->table('tblpayment');
        $builder->select('IFNULL(SUM(Total),0)total');
        $builder->WHERE('Status<>',0)
        ->WHERE('DATE_FORMAT(DateCreated,"%m")',$month)
        ->WHERE('DATE_FORMAT(DateCreated,"%Y")',$year);
        $orderList = $builder->get();